# Создать несколько переменных, вывести на экран.
# Запросить у пользователя несколько чисел и строк и сохранить в переменные. Вывести на экран.

name = 'Кеша'
age = 4
print('Переменные: ', name, age)

number = int(input('Введите любое число '))
print('Пользователь ввел число', number)

number1 = int(input('Введите другое число '))
print('Пользователь ввел число', number1)

string = input('Введите любую строку ')
print('Пользователь ввел строку', string)

string1 = input('Введите другую строку')
print('Пользователь ввел строку', string1)
